admin/run/jms/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cus="http://ibm.com/CustomerDetails/">
   <soapenv:Header/>
   <soapenv:Body>
      <cus:customer_details>
         <service_header>
            <brand>Tiger Bank</brand>
         </service_header>
         <first_name>Anthony</first_name>
         <last_name>Luc</last_name>
         <address>REPLACE_NUMBER Main Street</address>
      </cus:customer_details>
   </soapenv:Body>
</soapenv:Envelope>
