postman/customer-details-spring-ws.postman_collection.json

{
	"info": {
		"_postman_id": "8d9fa2ef-edc7-4ef2-84bd-7f27d5af8710",
		"name": "customer-details-spring-ws",
		"schema": "https://schema.getpostman.com/json/collection/v2.1.0/collection.json"
	},
	"item": [
		{
			"name": "customer-details-non-secure",
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<s11:Envelope xmlns:s11='http://schemas.xmlsoap.org/soap/envelope/'>\n  <s11:Body>\n    <sch:customerDetailsRequest xmlns:sch='http://ibm.com/CustomerDetails/'>\n      <sch:customer_details>\n        <sch:service_header>\n          <sch:brand>IBM</sch:brand>\n        </sch:service_header>\n        <sch:personal_details>\n          <sch:name_details>\n            <sch:first_name>saad</sch:first_name>\n            <sch:last_name>mia</sch:last_name>\n          </sch:name_details>\n          <sch:contact_details>\n            <sch:phone>333-7777777</sch:phone>\n            <sch:address>123 Main Street</sch:address>\n          </sch:contact_details>\n        </sch:personal_details>\n      </sch:customer_details>\n    </sch:customerDetailsRequest>\n  </s11:Body>\n</s11:Envelope>",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "http://localhost:8080/ws",
					"protocol": "http",
					"host": [
						"localhost"
					],
					"port": "8080",
					"path": [
						"ws"
					]
				}
			},
			"response": []
		}
	]
}